export const salesFilterFields = [
  {
    key: 'dateFilter',
    label: 'დროის ფილტრაცია',
    description: 'შეგვიძლია ავირჩიოთ და ვნახოთ რეალიზაციები ნებისმიერი პერიოდით.',
  },
  {
    key: 'productName',
    label: 'პროდუქციის დასახელება',
    description:
      'შეგვიძლია რეალიზაციები მოვძებნოთ დასახლების მიხედვით. მაგ: თუ ჩავწერთ „სიგარეტი“ , გვაჩვენებს მარტო ისეთი პროდუქციების რეალიზაციებს რომელიც დასახელებაში შეიცავს „სიგარეტი“-ს',
  },
  {
    key: 'barcode',
    label: 'კოდი',
    description: 'მოვძებნოთ რეალიზაცია შტრიხკოდის მიხედვით.',
  },
  {
    key: 'clientNumber',
    label: 'კლიენტის N',
    description:
      'ჩეკის ნომრის მიხედვით. გვიჩვენებს მარტო იმ რეალიზაციებს რომელიც კონკრეტულად მითითებულ ჩეკში არის გაყიდული.',
  },
  {
    key: 'summary',
    label: 'შეჯამება',
    description: 'აჯამებს ერთ კოდზე გაყიდულ ყველა რეალიზაცია.',
  },
  {
    key: 'deleted',
    label: 'წაშლილები',
    description:
      'რეპორტებიდან შესაძლებელია უკვე გაყიდული პროდუქციის ამოშლა. მაგ: თუ მომხმარებელმა გაყიდული პროდუქცია უკან დაგვიბრუნა, პროგრამიდან უნდა ამოვშალოთ რეალიზაცია, რადგან დაბრუნდეს ნაშთზე. ამოშლილი რეალიზაციის ნახვა.',
  },
  {
    key: 'transfer',
    label: 'გადაადგილება',
    description: 'შიდა გადაზიდვისთვის გატარებული პროდუქციების ნახვა.',
  },
];
