import cali from './cali.png';

export const docItems = [
  {
    width: 120,
    height: 55,
    src: 'https://megaplus.vercel.app/assets/images/docs/code-img.png',
    text: `კოდი: არის ალტერნიული დამატებითი პროდუქციის კოდი, რომელიც შეგვიძლია გამოვიყენოთ ალტერნატიულ შტრიხკოდათ, აღნიშნული კოდის შეცვლის შემთხვევაში გვექნება შესაძლებლობა ნომეკლატურის(პროდუქციის) რეალიზაცია მოვახდინოთ ორი სხვადასხვა შტრიხკოდი`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/qr-code.png',
    text: `შტრიხკოდი: არის პროდუქციის(ნომეკლატურის) ფიზიკური შტრიხკოდი`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/name-img.png',
    width: 200,
    height: 55,
    text: `დასახელება: არის ველი რომელშიც ჩანს პროდუქციის დასახელება თუ რა დასახელებით გვინდა რომ გამოჩნდეს იგი პროდუქციის ფანჯარაში`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/name-img.png',
    width: 200,
    height: 55,
    text: `დასახელება 2: არის ველი რომელშიც ჩანს პროდუქციის დასახელება რომელიც უნდა დაიწეროს რეალიზაციის დროს`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/coment-img.png',
    text: `კომენტარი: აღნიშნული ველი სტანდარტულად არის თავისუფალი მაგრამ შეგვიძლია გამოვიყენოთ ფილტრაციისთვისაც`,
  },
  {
    width: 80,
    height: 50,
    src: cali,
    text: `ერთეული: აღნიშნული ველი განაპირობებს პროდუციის ტიპს, არის ასაწონი და არის ცალობა. ასაწონის შემთხვევაში ერთეული უნდა გვქონდეს „კგ“ ხოლო ცალობის შემთხვევაში უნდა გვქონდეს „ცალი“`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/price-img.png',
    text: `ფასი: აღნიშნული ველი არის პროდუქციის სარეალიზაციო ფასი, თუ რა ფასად გვინდა რომ გაიყიდოს პროდუქტი`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/value-img.png',
    text: `პროდუქციის თვითღირებულება, რა ფასში ვიღებთ პროდუქციას.`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/group-img.png',
    text: `პროდუქციები შეგვიძლია დავყოთ ჯგუფებად და სასურველი პროდუქცია გავაწევრიანოთ შესაბამის ჯგუფში, რაც დაგვეხმარება აღწერაში, ფილტრაციაში და რეალიზაციების ნახვაში.`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/amount-img.png',
    text: `პროდუქციის პროგრამული ნაშთი, გვიჩვენებს რამდენი უნდა გვქონდეს პროდუქცია ფიზიკურად მაღაზიაში. 
           ნაშთზე მოქმედებს მიღება, დაბრუნება, რეალიზაცია , ჩამოწერა, აღწერა. 
           შესაბამისად თუ პროდუქციის პროგრამული რაოდენობა, არ ემთხვევა ფიზიკურ ნაშთს, პრობლემა ზემოთ ჩამოთვლილ ოპერაციებში უნდა ვეძებოთ.`,
  },

  {
    src: 'https://megaplus.vercel.app/assets/images/docs/old-price.png',
    text: `გვაჩვენებს რა წინა სარეალიზაციო ფასს. რა ფასი გვედო პროდუქციაზე სანამ ახალ ფასს დავადებდით.`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/ad-price.png',
    text: `სარეალიზაციო ფასი რომელიც რეკომენდირებულია. როგორც ვიცით იოლის ფრენჩაიზის შემთხვევაში`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/parcantage-img.png',
    text: `ნამატი პროცენტულად.`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/status-img.png',
    text: `გვიჩვენებს პროდუქციის სტატუსს , სტატუსში გვხვდება შემდეგი ინფორმაცია:`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/action-img.png',
    width: 110,
    height: 50,
    text: `პროდუქცია არის აქციაში. აქცია შეიძლება იყოს მომწოდებლის, ან ჩვენი შექმნილი აქცია. 
           რაც შეგვიძლია გავარჩიოთ კომენტარის საშუალებით.`,
  },
];

export const tasks = [
  { id: 1, text: 'პროგრამული ნაშთის შემოწმება პროდუქციის მიხედვით' },
  { id: 2, text: 'შექმნა/ჩაკორექტირება ნომეკლატურის(პროდუქციის)' },
  { id: 3, text: 'ნომენკლატურის(პროდუქციის) ფილტრაცია ჯგუფების მიხედვით' },
  { id: 4, text: 'ნომენკლატურის(პროდუქციის) ფილტრაცია დისტრიბუტორების მიხედვით' },
  { id: 5, text: 'ნომენკლატურის(პროდუქციის) ფასმაჩვენებლების ბეჭდვა' },
  { id: 6, text: 'ნომენკლატურის(პროდუქციის) EXCEL დოკუმენტში ექსპორტი' },
  { id: 7, text: 'ნომენკლატურის(პროდუქციის) სასწორზე გადაგზავნა' },
  { id: 8, text: 'ნომენკლატურის(პროდუქციის) ფილტრაცია მიღებების მიხედვით' },
  {
    id: 9,
    text: 'ნომენკლატურის(პროდუქციის) ფილტრაცია დისტრიბუტორის არსებული ხელშეკრულების მიხედვით',
  },
  { id: 10, text: 'ნომენკლატურის(პროდუქციის) აქციაში ჩასმის შესაძლებლობა' },
  { id: 11, text: 'ნომენკლატურის(პროდუქციის) ფილტრაცია კონკრეტული სვეტების მიხედვით' },
];
