import cali from './cali.png';

export const docItems = [
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/code-img.png',
    text: `კოდი არის ალტერნატიული შტრიხკოდი. შესაძლოა, ერთი და იგივე სახეობის პროდუქციას, ქონდეს სხვადასხვა შტრიხკოდი. 
          კოდი შესაძლებლობას გვაძლევს ერთი პროდუქცია გავყიდოთ 2 შტრიხკოდზე.`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/qr-code.png',
    text: `შტრიხკოდი, არის კოდი რომელიც აქვს პროდუქციას ფიზიკურად. რეალურად პროდუქციის შტრიხკოდში მოთავსებულია კოდი, რომელიც პროგრამაში უნდა იყოს მითითებული შტრიხკოდის ველში.`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/name-img.png',
    width: 250,
    height: 55,
    text: `დასახელება არის ინფორმაცია პროდუქციაზე. აქ შეგვიძლია ჩავწეროთ პროდუქციის სახეობა, ბრენდი, წონა , ფერი და ..
           რაც უფრო კონკრეტულად იქნება პროდუქციის დასახელება მითითებული მით უფრო გაგვიადვილდება სხვა პროდუქციისგან გარჩევა და ასევე პროგრამაში მოძიება.`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/coment-img.png',
    text: `კომენტარში შეგვხვდება უფრო ზუსტი ინფორმაცია აქციის შესახებ. ვისი აქციაა კონკრეტულად და პერიოდი, საიდან სადამდე მოქმედებს აქცია.`,
  },
  {
    width: 140,
    height: 55,
    src: cali,
    text: `ერთეული განაპირობებს როგორ გაიყიდება პროდუქცია , ცალობით თუ წონით. იმ შემთხვევაში თუ პროდუქცია უნდა გაიყიდოს ცალობით, ერთეულში უნდა მივუთითოთ „ცალი“, ხოლო თუ პროდუქცია უნდა გაიყიდოს წონით, მაშინ „კგ“(სხვა ერთეულის მითითების შემთხვევაში პროდუქცია არ გადაიგზავნება სასწორზე).`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/price-img.png',
    text: `ფასი არის სარეალიზაციო ფასი, უნდა მივუთითოთ რა ფასში გვინდა რომ გაიყიდოს პროდუქცია.`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/value-img.png',
    text: `პროდუქციის თვითღირებულება, რა ფასში ვიღებთ პროდუქციას.`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/group-img.png',
    text: `პროდუქციები შეგვიძლია დავყოთ ჯგუფებად და სასურველი პროდუქცია გავაწევრიანოთ შესაბამის ჯგუფში, რაც დაგვეხმარება აღწერაში, ფილტრაციაში და რეალიზაციების ნახვაში.`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/amount-img.png',
    text: `პროდუქციის პროგრამული ნაშთი, გვიჩვენებს რამდენი უნდა გვქონდეს პროდუქცია ფიზიკურად მაღაზიაში. 
           ნაშთზე მოქმედებს მიღება, დაბრუნება, რეალიზაცია , ჩამოწერა, აღწერა. 
           შესაბამისად თუ პროდუქციის პროგრამული რაოდენობა, არ ემთხვევა ფიზიკურ ნაშთს, პრობლემა ზემოთ ჩამოთვლილ ოპერაციებში უნდა ვეძებოთ.`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/status-img.png',
    text: `გვიჩვენებს პროდუქციის სტატუსს , სტატუსში გვხვდება შემდეგი ინფორმაცია:`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/action-img.png',
    width: 110,
    height: 50,
    text: `პროდუქცია არის აქციაში. აქცია შეიძლება იყოს მომწოდებლის, ან ჩვენი შექმნილი აქცია. 
           რაც შეგვიძლია გავარჩიოთ კომენტარის საშუალებით.`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/new-action.png',
    width: 110,
    height: 50,
    text: `ასევე გვიჩვენებს რომ პროდუქცია არის აქციაში , განსხვავება ის არის, რომ პროდუქციებს რომელთაც ეს ნიშანი აქვს დღეს არის აქციაში ჩასმული.`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/old-action.png',
    width: 110,
    height: 50,
    text: `აქციიდან ამოვარდნილი პროდუქციები. აქციაში იყო პროდუქცია და დღეს დასრულდა აქცია.`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/carfur-new-action.png',
    width: 110,
    height: 50,
    text: `ახალი რეკომენდაცია გასაყიდ ფასზე. რეკომენდირებული ფასი შეიცვალა.`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/auto-img.png',
    width: 120,
    height: 50,
    text: `პროდუქციას ავტომატურად შეეცვალა გასაყიდი ფასი და დაედო რეკომენდირებული ფასი. 
           ეს ხდება რა თქმა უნდა იმ შემთხვევაში თუ რეკომენდირებულ ფასებს ვიყენებთ.`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/change-price.png',
    width: 130,
    height: 50,
    text: `პროდუქციაზე მოხდა ცვლილება, არ არის მითითებული კონკრეტულად რა სახის ცვლილებაზეა საუბარი, 
           მაგრამ უნდა ვიცოდეთ რომ ცვლილება შეიძლება იყოს: დასახელება, მომწოდებელი, ხელშეკრულება.`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/old-price.png',
    text: `გვაჩვენებს რა წინა სარეალიზაციო ფასს. რა ფასი გვედო პროდუქციაზე სანამ ახალ ფასს დავადებდით.`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/ad-price.png',
    text: `სარეალიზაციო ფასი რომელიც რეკომენდირებულია. როგორც ვიცით იოლის ფრენჩაიზის შემთხვევაში`,
  },
  {
    src: 'https://megaplus.vercel.app/assets/images/docs/parcantage-img.png',
    text: `ნამატი პროცენტულად.`,
  },
];
