import H2Title from '@/utils/h2title';
import { Image } from 'antd';

const AcceptanceByPurchaseAct = () => {
  return (
    <div>
      <H2Title className="!mb-6 text-xl" title="მიღება შესყიდვის აქტით" />
      <p>
        შეიძლება პროდუქცია მივიღოთ ისეთი მომწოდებლისგან რომელიც ვერ გვიტვირთავს ზედნადებს, ასეთ
        შემთხვევაში ბუღალტერმა უნდა დაგვიმზადოს შესყიდვის აქტი, რის საფუძველზეც პროგრამაში
        დავაფიქსირებთ მიღებას ხელით. შესყიდვის აქტით მიღების დროს ხელით უნდა შევიყვანოთ ყველა ის
        ინფორმაცია რაც ზედნადებიდან გადმოდის მიღების ფანჯარაში. <br /> ვნახოთ პრაქტიკულად: პირველ
        რიგში უნდა შევიყვანოთ მომწოდებელი. (მომწოდებელი თუ არ არსებობს გადადით მომწოდებლების
        ფანჯარაში)
      </p>
      <p className="!my-6">
        მოვძებნოთ პროდუქცია შტრიხკოდით ან დასახელებით, ავირჩიოთ პროდუქცია და გადმოვა მიღების
        ფანჯარაში.
      </p>
      <div>
        <Image
          className="!mb-6"
          src="https://megaplus.vercel.app/assets/images/docs/code-table.png"
          preview={false}
        />
      </div>
      <div>
        <Image
          src="https://megaplus.vercel.app/assets/images/docs/table-rs-2.png"
          preview={false}
        />
      </div>
      <p className="!my-6">
        ჩავწეროთ: <br /> <strong>რაოდენობა</strong> - რამდენი მივიღეთ <br /> <strong>ფასი</strong> -
        რამდენი გადავიხადეთ <br /> (ჯამი და თვითღირებულება ავტომატურად შეივსება) <br /> შევიყვანოთ
        გასაყიდი ფასი და ავირჩიოთ ეხება თუ არა პროდუქციას დღგ. <br /> <br />
        მივანიჭოთ დოკუმენტის ნომერი, დოკუმენტის ნომერი შეიძლება იყოს შესყიდვის აქტის დოკუმენტის
        ნომერი ან შეგვიძლია ნებისმიერი ნომერი მივანიჭოთ <br /> (არ მიუთითოთ ქართული ან ინგლისური
        სიმბოლოები)
      </p>
      <Image
        src=" https://megaplus.vercel.app/assets/images/docs/doc-numb-rs.png"
        preview={false}
      />
      <p className="!mt-4">
        თუ პროდუქცია არ არის რეგისტრირებული ამ შემთხვევაში შეგვიძლია პროდუქცია შევქმნათ მწვანე
        პლიუსის გამოყენებით. ბოლოს დავაჭიროთ შესრულებას.
      </p>
    </div>
  );
};

export default AcceptanceByPurchaseAct;
