interface DocumentFieldsTypes {
  title: string;
  description: string;
}

export const documentFields: DocumentFieldsTypes[] = [
  {
    title: 'ზედნადების ნომერი',
    description: 'დოკუმენტის ნომერი , არის უნიკალური , ვერ ექნება სხვა ზედნადებს იგივე ნომერი.',
  },
  {
    title: 'ტიპი',
    description: 'ზედნადები შესაძლოა იყოს , აქტივირებული , დასრულებული ან გაუქმებული.',
  },
  {
    title: 'სტატუსი',
    description: 'ზედნადების სტატუსი.',
  },
  {
    title: 'მომწოდებელი',
    description: 'მომწოდებლის დასახელება, ვის შემოაქვს პროდუქცია.',
  },
  {
    title: 'საიდენტიფიკაციო',
    description: 'მომწოდებლის საიდენთიფიკაციო კოდი.',
  },
  {
    title: 'თანხა',
    description: 'ზედნადებში ატვირთული პროდუქციების ჯამური თვითღირებულება.',
  },
  {
    title: 'ტრანსპორტირების დასრულების ადგილი',
    description:
      'უნდა იყოს ჩვენი ობიექტის მისამართი, დაბრუნების ზედნადებზე შეგვხვედა მომწოდებლის მისამართი.',
  },
  {
    title: 'აქტივაციის თარიღი',
    description: 'როდის გააქტიურდა ზედნადები.',
  },
  {
    title: 'ჩასწორება',
    description:
      'მომოწდებელმა ჩაასწორა თუ არა ზედნადები, პროგრამაში არ ჩანს კონკრეტულად რა არის ჩასწორებული. შეგვიძლია ვნახოთ RS -ის საიტზე.',
  },
  {
    title: 'მიღებული',
    description: 'რა თანხაში მივიღეთ ზედნადები, უნდა ემთხეოდეს მომწოდებლის ატვირთულ თანხას.',
  },
  {
    title: 'ობიექტი',
    description: 'მიღების შემდეგ ჩაიწერება ობიექტის ნომერი რომელზეც არის მიღებული ეს ზედნადები.',
  },
  {
    title: 'ხელშეკრულების ნომერი',
    description: 'მიღების შემდეგ ჩაიწერე იმ ხელშეკრულების ნომერი რომლითაც მივიღებთ ზედნადებს.',
  },
];

export const productFields: DocumentFieldsTypes[] = [
  {
    title: 'RS დასახელება',
    description: 'მომწოდებლის მიერ მითითებული პროდუქციის დასახელება.',
  },
  {
    title: 'დასახელება',
    description: 'პროდუქციის დასახელება.',
  },
  {
    title: 'ერთეული',
    description: 'მომწოდებელმა რა ერთეულით ატვირთა პროდუქცია.',
  },
  {
    title: 'რაოდენობა',
    description: 'რამდენი ერთეული უნდა შემოიტანოს მომწოდებელმა.',
  },
  {
    title: 'RS ფასი',
    description:
      'მომწოდებლის მიერ მითითებული პროდუქციის თვითღირებულება. ანუ რა ფასში შემოაქვს პროდუქცია',
  },
  {
    title: 'ფასი',
    description: 'ხელშეკრულებაში რა ფასად ზის პროდუქცია.',
  },
  {
    title: 'ჯამი',
    description: 'რაოდენობა გამრავლებული RS ფასზე, პროდუქციის ჯამური თვითღირებულება.',
  },
  {
    title: 'RS კოდი',
    description:
      'მომწოდებლის მიერ მითითებული კოდი , უნდა იყოს პროდუქციის შტრიხკოდი, მაგრამ ხანდახან მომწოდებლები არ უთითებენ პროდუქციის შტრიხკოდს და გვხვდება ციფრები ან სხვა სიმბოლოები.',
  },
  {
    title: 'კოდი',
    description:
      'ატვირთული პროდუქცია რა კოდთან არის დაკავშირებული. რა თქმა უნდა ატვირთული პროდუქცია უნდა იყოს იმ შტრიხკოდთან დაკავშირებული რაც აქვს ფიზიკურად. სხვა შემთხვევაში პროდუქციას არ გაატარებს სალაროზე ან შესაძლოა აბსოლუტურად სხვა პროდუქციაზე დავაკავშიროთ მაგ: შემოგვიტანონ კარაქი და ჩვენ დავაკავშიროთ მაწონთან, ამ შემთხვევაში ფიზიკურად მივიღებთ კარაქს, მაგრამ ამ შეცდომის გამო პროგრამულად აგვესახება მაწონი. რაც გამოიწვევს ნაშთის პრობლემას.',
  },
  {
    title: 'ხელშ',
    description: 'გვაჩვენეს რომ პროდუქცია ზის ხელშეკრულებაში, არ უნდა იყოს წითელი ფერი.',
  },
];

export const productSearchInstructions: DocumentFieldsTypes[] = [
  {
    title: 'კოდით ძებნა',
    description: 'შეგვიძლია პროდუქცია მოვძებნოთ შტრიხკოდით და კოდით.',
  },
  {
    title: 'დასახელებით ძებნა',
    description: 'შეგვიძლია პროდუქცია მოვძებნოთ დასახელებით და შტრიხკოდით.',
  },
  {
    title: 'კონკრეტული მომწოდებლის პროდუქციაში ძებნა',
    description:
      'ხელშეკრულებიანი მომწოდებლის მიღების დროს აუცილებელია, რომ ეს გრაფა იყოს მონიშნული, რადგან გვიჩვენოს ისეთი პროდუქციები, რომელიც ზის არჩეულ ხელშეკრულებაში. უნდა ამოვნიშნოთ იმ შემთხვევაში თუ ვიღებთ უხელშეკრულებო მომწოდებელის პროდუქციებს.',
  },
  {
    title: 'შექმნა',
    description:
      'ვიყენებთ იმ შემთხვევაში როდესაც უხელშეკრულებო მომწოდებლისგან ვიღებთ პროდუქციას და ეს პროდუქცია არ არსებობს ბაზაში.',
  },
  {
    title: 'კავშირი',
    description:
      'ვიყენებთ როდესაც პროდუქცია წითელია უნდა მოვძებნოთ , ავირჩიოთ და დავაკავშიროთ შესაბამის პროდუქციაზე (უნდა ავირჩიოთ ორივე, რომელ პროდუქციასაც ვაკავშირებთ და რომელ პროდუქციაზეც ვაკავშირებთ, არჩეულია პროდუქცია როდესაც არის ლურჯი.)',
  },
];
