import H2Title from '@/utils/h2title';
import { Image } from 'antd';
import { documentFields, productFields, productSearchInstructions } from './data';

const Reception = () => {
  return (
    <div>
      <div>
        <H2Title className="text-xl" title="მიღება" />
        <div>
          <p className="!my-4">
            პროდუქციის მიღება , როდესაც პროდუქციას მოიტანენ ფიზიკურად, უნდა დავაფიქსიროთ
            პროგრამაშიც, რადგან პროგრამულ ნაშთზე აისახოს და პროდუქციის პროგრამული რაოდენობა
            ემთხვეოდეს ფიზიკურ ნაშთს. მომწოდებელი პროდუქციის მოტანამდე გვიტვირთავს ზედნადებს RS-ზე,
            პროგრამა დაკავშირებულია RS-თან, შესაბამისად ზედნადებები გამოჩნდება პროგრამაშიც.
          </p>
          <span className="!mb-6 flex items-center gap-x-3">
            <span>გავხსნათ პროგრამა , შევიდეთ მიღებაში, დავაჭიროთ</span>
            <Image
              src="https://megaplus.vercel.app/assets/images/docs/rs-logo.png"
              preview={false}
            />
            <span>ლოგოს.</span>
          </span>
          <Image
            width={'70%'}
            height={'70%'}
            src="https://megaplus.vercel.app/assets/images/docs/rs-window.png"
          />
        </div>
        <div>
          <p className="!my-6">
            გამოტანილი ფანჯარა არის პროგრამის RS ფანჯარა, რომელსაც ინფორმაცია მოაქვს ჩვენი კომპანიის
            RS-ის საიტიდან.
          </p>
          <span>ვნახოთ რა ინფორმაცია გვაქვს RS - ფანჯარაში:</span>

          <p className="!my-6">
            დროის ფილტრაციის მეშვეობით შეგვიძლია მოვძებნოთ ზედნადებები ნებისმიერ თარიღში.
          </p>
          <Image src="https://megaplus.vercel.app/assets/images/docs/rs-date.png" preview={false} />
        </div>

        <div>
          <p className="!my-6">
            დროის ფილტრაციის გამოყენება: უნდა დავაჭიროთ RS-ლოგოს, გამოგვიტანს კალენდრის ფანჯარას,
            პირველ ფანჯარაში უნდა ავირჩიოთ დაწყების თაროღი, "კი" ღილაკის დაჭერის შემდეგ გამოვა მეორე
            იდენტური კალენდრის ფანჯარა სადაც უნდა ავირჩიოთ დასრულების თარიღი, შემდგომ დავაწკაპუნოთ
            "კი"-ს.
          </p>
          <div className="grid grid-cols-2">
            <Image
              preview={false}
              width={'90%'}
              height={'100%'}
              src="https://megaplus.vercel.app/assets/images/docs/calendar-img-1.png"
            />
            <Image
              preview={false}
              width={'90%'}
              height={'100%'}
              src="https://megaplus.vercel.app/assets/images/docs/calendar-img-1.png"
            />
          </div>
        </div>

        <div>
          <p className="!mt-6 !mb-3">
            ასევე შეგვიძლია ზედნადებები გავფილტროთ , მომწოდებლის დასახელების , საიდენთიფიკაციო კოდის
            და ზედნადების ნომრის მიხედვით. <br /> ჩავწეროთ ფილტრაციაში შესაბამისი ინფორმაცია.
          </p>
          <Image
            src="https://megaplus.vercel.app/assets/images/docs/rs-filtration.png"
            preview={false}
          />
          <p className="!my-3">
            თუ ერთ შ.პ.ს -ს აქვს რამოდენიმე ობიექტი სხვადასხვა მისამართზე, რომელიმე მისამართზე
            ატვირთული ზედნადები ყველა ობიექტს გამოუჩნდება, რაც ზრდის იმის რისკებს რომ სხვა ობიექტის
            ზედნადები მივიღოთ, ანუ პროგრამულად მივიღოთ ისეთი პროდუქცია რომელიც რეალურად ჩვენს
            ობიექტზე არ მოუტანიათ. ამ ყველაფრის თავიდან ასაცილებლად , შეგვიძლია გამოვიყენოთ
            მისამართის ფილტრაცია:
          </p>
          <Image
            className="!my-3"
            src="https://megaplus.vercel.app/assets/images/docs/adress-filtration-rs.png"
            preview={false}
          />
          <p>
            ჩავწეროთ ჩვენი მისამართის რაიმე ამონარიდი. მისამართის სრულად ჩაწერა არ არის
            რეკომენდირებული რადგან მომწოდებლები ხანდახან ზუსტი მისამართით არ ტვირთავენ ზედნადებებს
            და შესაძლოა ჩვენს მიერ ჩაწერილ სიმბოლოებს არ შეიცავდეს მომწოდებლის მიერ მითითებული
            მისამართი, შესაბამისად არ გვიჩვენებს ზედნადებს.
          </p>
          <span className="!mt-3 flex items-center gap-x-3">
            <span>
              დამატებითი ფილტრაციის პარამეტრების გამოსატანად , მარცხენა ზედა კუთხეში დავაჭიროთ
            </span>
            <Image
              src="https://megaplus.vercel.app/assets/images/docs/rs-arrow.png"
              preview={false}
            />
            <span>ღილაკს.</span>
          </span>
        </div>
        <div>
          <H2Title className="text-xl" title="დამატებითი ფილტრაცია" />
          <div>
            <p className="!my-3">
              ზედნადები შესაძლოა იყოს აქტივირებული , დასრულებული და გაუქმებული. აქტივირებულია
              ზედნადები, როდესაც ზედნადებს ჯერ არ დავთანხმებულვართ. დასრულებულია ზედნადები რომელიც
              დავიდასტურეთ. გაუქმებულია ზედნადები რომელიც არ შესრულდა, შესაძლოა მომწოდებელმა
              ზედნადებში მითითებულ თარიღში ვერ მოიტანონ პროდუქცია, ამ შემთხვევაში ატვირთული
              ზედნადები გაუქმდება და როდესაც მოიტანენ იმ თარიღში აიტვირთება ზედნადები, გაუქმებული
              ზედნადები არ უნდა მივიღოთ , არ უნდა იყოს თეთრი. წინააღმდეგ შემთხვევაში გვექნება ნაშთის
              და დავალიანების პრობლემა.
            </p>
            <Image
              src="https://megaplus.vercel.app/assets/images/docs/status-rs.png"
              preview={false}
            />
            <Image
              src="https://megaplus.vercel.app/assets/images/docs/types-rs.png"
              preview={false}
            />
          </div>
          <div className="!mt-6">
            <p className="!mb-6">
              შემდეგი ფანჯარა გვაძლევს საშუალებას გავფილტროთ , გაუტარებელი - მიუღებელი,
              დაკორექტირებული - მომწოდებლის მიერ ჩასწორებული ზედნადები შეიძლება იყოს ჩასწორებული
              პროდუქცია , რაოდენობა, ფასი , მისამართი ან სხვა. გაუქმებული - მომწოდებლის მიერ
              გაუქმებული ზედნადები.
            </p>
            <Image
              src="https://megaplus.vercel.app/assets/images/docs/img-window.png"
              preview={false}
            />
          </div>
        </div>

        <div className="">
          <H2Title className="!mb-8 text-xl" title="ზედნადების ინფორმაცია" />
          <Image
            src="https://megaplus.vercel.app/assets/images/docs/rs-table.png"
            preview={false}
          />
          <p className="!my-6">ზედნადებების განჯარაში გვხვდება შემდეგი ინფორმაცია:</p>
          <ul className="list-disc space-y-2 !pl-5 *:!mb-3">
            {documentFields.map((item, index) => (
              <li key={index}>
                <strong>{item.title}</strong> - {item.description}
              </li>
            ))}
          </ul>
          <p className="!my-6">
            სურათში მითითებულ ფანჯარაში ნებისმიერ ადგილას თუ დავაჭერთ მაუსის მარჯვენა ღილაკს
            გამოგვიტანს ფანჯარას საიდანაც შეგვიძლია დამატებითი ინფორმაცია გამოვიტანოთ ზედნადებების
            შესახებ, როგორიცაა , ტრანსპორტირების დაწყება, მანქანის ნომერი, მძღოლის პირადი ნომერი და
            ზედნადებში მითითებული სხვა ინფორმაცია. ზედნადები შეიძლება იყოს , წითელი - მიუღებელი,
            თეთრი- მიღებული, ყვეითელი - ზედნადების თანხა და მიღებლი თანხა ერთმანეთს არ ედრება.
            დავაჭიროთ სასურველ ზედნადებს მისაღებად, გამოგვიტანს ხელშეკრულების ფანჯარას
          </p>
        </div>
        <div>
          <H2Title className="text-xl" title="ხელშეკრულებები" />
          <p className="!my-6">
            ვხედავთ ხელშეკრულების ნომერს , დასახელებას, დაწყების თარიღს და სტატუსს. აქ უნდა ავირჩიოთ
            რომელი ხელშეკრულებით ვიღებთ პროდუქციას, ხელშეკრულებები ეთმანეთისგან განსხვავდება როგორც
            გადახდის პირობებით ასევე პროდუქციის სახეობებით, ანუ დანაყოფებით. აუცილებელია რომ
            პროდუქცია მივიღოთ სწორი ხელშეკრულებით, წინააღმდეგ შემთხვევაში არ დაგვერიცხება ბონუსები ,
            ქეშბექები და დავალიანებასაც გვაჩვენებს არასწორად, რის შემდეგაც შეიძლება მომწოდებელმა
            დაგვბლოკოს. სწორი ხელშეკრულებით მისაღებად არ უნდა ავირჩიოთ წითელი, არააქტიური,
            ხელშეკრულება , ასევე არ ვირჩევთ ხელშეკრულებას რომელშიც წერია „დახურულია“ - ეს ნიშნავს
            რომ ხელშეკრულება მალე გაუქმდება. სწორი ხელშეკრულებით მისაღებად არ უნდა ავირჩიოთ წითელი,
            არააქტიური, ხელშეკრულება , ასევე არ ვირჩევთ ხელშეკრულებას რომელშიც წერია „დახურულია“ -
            ეს ნიშნავს რომ ხელშეკრულება მალე გაუქმდება.
          </p>
          <Image
            src="https://megaplus.vercel.app/assets/images/docs/rs-contract-img.png"
            preview={false}
          />
        </div>

        <div>
          <H2Title className="text-xl" title="ზედნადების პროდუქციის ინფორმაცია" />
          <Image
            className="!my-6"
            src="https://megaplus.vercel.app/assets/images/docs/rs-naming-table.png"
            preview={false}
          />
          <ul className="list-disc space-y-2 !pl-5">
            {productFields.map((item, index) => (
              <li key={index}>
                <strong>{item.title}</strong> - {item.description}
              </li>
            ))}
          </ul>
          <p className="!my-6">პროდუქცია შეიძლება შეგხვდეს სამი ფერის:</p>
          <div className="*:!mt-6">
            <p className="">
              <strong>წითელი</strong> - პროდუქცია არაფერთან არ არის დაკავშირებული. ამ შემთხევაში
              პროდუქცია უნდა მოვძებნოთ და დავაკავშიროთ. პროდუქციის მოძებნამდე უნდა დავრწმუნდეთ რომ
              სწორი ხელშეკრულება გვაქვს მითითებული. რადგან ბაზაში, სადაც უნდა მოვძებნოთ პროდუქცია,
              გვიჩვენებს მხოლოდ იმ პროდუქციებს რომელიც არჩეულ ხელშეკრულებაში ზის.
            </p>
            <p className="">
              <strong>ყვითელი</strong> - RS ფასი(შემოტანის ფასი) არ ემთხვევა იმ ფასს, რა ფასშიც არის
              ჩასმული ხელშეკრულებაში. ამის მიზეზი შეიძლაბა იყოს ის, რომ პროდუქცია გაძვირდა, ან
              პროგრამული განახლება არ გქონდეთ მიღებული. შეგიძლიათ დაუკავშირდეთ მეგა-ს გადაამოწმოთ
              განახლებულია თუ არა თქვენი ბაზა.
            </p>
            <p className="">
              <strong>თეთრი</strong> - ნიშნავს რომ პროდუქცია დაკავშირებულია და ფასი არ არის RS ფასზე
              მაღალი.
            </p>
          </div>

          <Image
            className="!mt-6"
            src="https://megaplus.vercel.app/assets/images/docs/rs-code-table.png"
            preview={false}
          />
          <p className="!my-6">
            ამ ფანჯარაში ფილტრაციისთვის გვაქვს პროდუქციის დასახელებით, შტრიხკოდით და კოდით.
          </p>
          <Image
            src="https://megaplus.vercel.app/assets/images/docs/rs-connection.png"
            preview={false}
          />

          <ul className="!mt-3 list-disc space-y-2 !pl-5 *:!mb-3">
            {productSearchInstructions.map((item, index) => (
              <li key={index}>
                <strong>{item.title}</strong> - {item.description}
              </li>
            ))}
          </ul>

          <Image
            className="!mt-12"
            src="https://megaplus.vercel.app/assets/images/docs/in-box-src.png"
            preview={false}
          />
          <p className="!mt-2">
            მომწოდებელს შეიძლება პროდუქცია ჰქონდეს ატვირთული ყუთით. ამის ყველაზე კარგი მაგალითია
            სიგარეტების შემთხვევა, ხშირად მომწოდებლები სიგარეტს ტვირთავენ ბლოკით, პირობითად 20
            კოლოფი სიგარეტის მიღების დროს, ზედნადებში შეიძლება ეწეროს 2 ცალი. ამ შემთხვევაში
            RS-ფასში ეწერება ბლოკის და არა ერთი კოლოფი სიგარეტის ფასი. ასეთი პროდუქცია უნდა
            ჩავშალოთ. პროდუქციის ჩასაშლელად უნდა გამოვიყენოთ ჩაშლა. ჩავწეროთ რამდენი კოლოფი
            სიგარეტია ერთ ბლოკში(10) და დავაჭოროთ პროდუქცია ჩაიშლება, RS ფასში ჩაიწერება 1 კოლოფი
            სიგარეტის ფასი. ჩაშლამდე პროდუქცია უნდა იყოს დაკავშირებული. წონის, ან ისეთი პროდუქციის
            მიღების დროს, რომელსაც არ აქვს შტრიხკოდი, დაგვჭირდება, რომ მივანიჭოთ ხელის კოდი, ხელის
            კოდის მისანიჭებლად უნდა მოვძებნოთ პროდუქცია და შტრიხკოდთან დავაჭიროთ მაუსის მარჯვენა
            ღილაკს, ავირჩიოთ შიდა კოდის მინიჭება იმ შემთხვევაში თუ გვინდა პროგრამამ ავტომატურად
            მიანიჭოს 4 ნიშნა კოდი, ან ავირჩიოთ კოდის გადაკეთება, რის შემდეგაც ნებისმიერი კოდის
            მინიჭება შეგვეძლება პროდუქციაზე, ასევე ანალოგიურად შეგვიძლია გადავაკეთოთ პროდუქციის
            შტრიხკოდი. გადაკეთების შემდეგ პროდუქცია უნდა გადავაკავშიროთ გადაკეთებულ კოდზე. მსგავსი
            ოპერაციების გაკეთება გვჭირდება პირველად მიღების დროს, პროგრამა დაიმახსოვრებს ჩაშლას და
            პროდუქციის კავშირსაც და შემდეგ მიღებებზე ეს ოპერაციები უკვე იქნება გაკეთებული.
          </p>

          <p className="!mt-12 !mb-3">
            <strong>შევაჯამოთ</strong>: მიღების დროს, უნდა მოვძებნოთ ზედნადები რომლის მიღებაც
            გვინდა, ავირჩიოთ, გამოტანილ ხელშეკრულებაში ავირჩიოთ სწორი ხელშეკრულება, გადავამოწმოთ
            კოდები თუ სწორად არის დაკავშირებული, თუ არის ჩასაშლელი ჩავშალოთ, ამის შემდეგ დავაჭიროთ:
          </p>
          <Image
            src="https://megaplus.vercel.app/assets/images/docs/move-auorized-doc.png"
            preview={false}
          />
          <p className="!my-3">ამის შემდეგ ზედნადებში გადმოვა მიღებაში</p>
          <Image src="https://megaplus.vercel.app/assets/images/recieve-rs.png" preview={false} />
          <p className="!mb-2">
            აქ უნდა მივუთითოთ სარეალიზაციო ფასი, გასაყიდ ფასში ჩავწეროთ სასურველი ფასი, შეგვიძლია
            პროცენტულად მოვუმატოთ ან მოგების მიხედვით შევცვალოთ. შეგვიძლია რამოდენიმე პროდუქციას
            საერთო ფასი ან პროცენტი დავადოთ. ამისათვის რომლებზეც გვინდა იმ პროდუქციის ფასის ან
            პროცენტის სვეტი უნდა მოვნიშნოთ დავაჭიროთ ENTER-ს კლავიატურაზე და გამოტანილ ფანჯარაში
            ჩავწეროთ სასურველი საერთო ფასი ან პროცენტი. <br />
            <br />
            ფასის შეცვლის შემდეგ დაგვჭირდება ფას მაჩვენებლების ამოღება პრინტერიდან. მარცხენა ქვედა
            კუთხეში გვაქვს ბარი საიდანაც შეგვიძლია ამოვიღოთ ფასები ან გადავაგზავნოთ პროდუქცია
            სასწორზე.
          </p>
          <Image
            src="https://megaplus.vercel.app/assets/images/docs/scale-rs.png"
            preview={false}
          />

          <div className="!my-3 flex items-center gap-x-4">
            <span>ბოლოს შეგვიძლია დავაჭიროთ</span>
            <Image
              src="https://megaplus.vercel.app/assets/images/docs/rs-done-btn.png"
              preview={false}
            />
          </div>
        </div>
      </div>
    </div>
  );
};

export default Reception;
