export const mainSettingsList = [
  {
    title: 'CASHBOX',
    description:
      'შეგვიძლია ჩავრთოთ ფუნქცია, რომლის მეშვეობითაც ნაღდზე რეალიზაციის შემდეგ ავტომატურად გაიღება ფულის ყუთი (აუცილებელია, რომ ფულის ყუთი შეერთებული იყოს POS-ზე (COM1) და ფულის ყუთს ქონდეს ავტომატური გაღების ფუნქცია).',
  },
  {
    title: 'PRINTER',
    description: 'ჩამონათვალის პრინტერის პროგრამასთან დაკავშირების შემდეგ მისი გააქტიურება.',
  },
  {
    title: 'გათიშვა',
    description: 'მონიშნულია, როდესაც ჩამონათვალის პრინტერს არ ვიყენებთ.',
  },
  {
    title: 'F12-ის აკრძალვა',
    description: 'მოლოდინის რეჟიმში გადატანის აკრძალვა.',
  },
  {
    title: 'მინუს გაყიდვების აკრძალვა',
    description: 'არ გაატარებს ისეთ პროდუქციას, რომელიც არ გვექნება ნაშთზე პროგრამულად.',
  },
  {
    title: 'ჩამოკლების აკრძალვა',
    description: 'მოლარე ვერ შეძლებს გატარებული პროდუქციის ამოშლას.',
  },
  {
    title: 'უნაღდო ჩეკის გათიშვა',
    description: 'ბარათით გადახდის დროს სალარო აპარატიდან ჩეკი არ ამოვა.',
  },
  {
    title: 'კლიენტის ტაბლო',
    description:
      'დამატებითი ეკრანის შემთხვევაში მომხმარებელი დაინახავს მეორე ეკრანზე იმ პროდუქციას, რასაც ატარებს მოლარე რეალიზაციის ფანჯარაში, ასევე ფასი და რაოდენობაც.',
  },
  {
    title: 'უჩეკოს აკრძალვა',
    description:
      'პროგრამა არ გადაუშვებს რეალიზაციას, როდესაც სალარო აპარატი არ იმუშავებს (ანუ სანამ ჩეკი არ ამოვა სალაროდან, მაშინაც კი თუ აპარატთან კავშირი შეწყდება).',
  },
  {
    title: 'ჯამის დამალვა',
    description:
      'ვიყენებთ შერეული გადახდის დამატების დროს. მალავს გაყიდული პროდუქციის ჯამურ თანხას.',
  },
];

export const configSettings = [
  {
    title: 'სალარო აპარატის ნომერი',
    description: 'შეგვიძლია ჩავწეროთ ჩვენი სალარო აპარატის ნომერი.',
  },
  {
    title: 'ტერმინალები',
    description:
      'უნდა ჩავწეროთ ტერმინალის ინფორმაცია შემდეგი თანმიმდევრობით: ბანკი - ტერმინალის მოდელი - კომის ნომერი - ტერმინალის პოს აიდი. მაგ: TBC VER9SH000001.',
  },
  {
    title: 'უხელშეკ. მიღების აკრძ.',
    description:
      'მიღების დროს თუ ყველა პროდუქცია არ იჯდა არჩეულ ხელშეკრულებაში არ მიგვაღებინებს ზედნადებს, ასევე ხელშეკრულების გარეშე ვერ მივიღებთ ზედნადებს.',
  },
  {
    title: 'RS რაოდ. კორექტირების აკრძალვა',
    description:
      'პროგრამაში RS ფანჯარაში შესაძლებელი მომწოდებლის მიერ ატვირთული რაოდენობის კორექტირება, თუ ამ ფუნქციას ჩავრთავთ აღარ შეგვეძლება რაოდენობის ჩასწორება ზედნადებში.',
  },
  {
    title: 'რეალიზ. ჩასწორების აკრძალვა',
    description: 'აღარ შეგვეძლება უკვე რეალიზებული პროდუქციის ამოშლა პროგრამიდან.',
  },
  {
    title: 'სალაროში ფასის ჩასწორების დაშვება',
    description:
      'სალაროში მოლარეს არ შეუძლია სარეალიზაციო ფასის ჩასწორება; თუ ამ ფუნქციას ჩავრთავთ, შეეძლება ჩასწორება.',
  },
  {
    title: 'პაროლის მოთხოვნა ფანჯარაში შესვლისთვის',
    description:
      'ამ ფანჯარაში შესვლა არ არის შესაძლებელი ყველა მომხმარებლისთვის და ჭირდება სპეციალური პაროლი, რომელიც უნდა შევიყვანოთ ცარიელ ფანჯარაში და დავაჭიროთ ACTIVATE ღილაკს.',
  },
];
