import H2Title from '@/utils/h2title';
import { Image } from 'antd';

const Permissions = () => {
  return (
    <div>
      <H2Title className="!mb-10 text-xl" title="მომხმარებლების უფლებები" />

      <div className="grid grid-cols-5 gap-x-6">
        <div className="">
          <Image src="https://megaplus.vercel.app/assets/images/docs/users-skill-img.png"  preview={false}/>
        </div>
        <div className="col-span-4">
          <span>
          იუზერებს შეგვიძლია ავუკრძალოთ პროგრამის კონკრეტული მოდულები ან მოდულებში შევუზღუდოთ
          გარკვეული ფუნქციები. ავირჩიოთ მომხმარებელი და წაუშალოთ მონიშვნა სასურველ მოდულს, რის
          შემდეგაც ამ იუზერს არ გამოუჩნდება ამონიშნული მოდული, შესაბამისად ვერ შეძლებს ამ მოდულის
          გამოყენებას. მოლარეების იუზერზე არ აქვს მნიშვნელობა იქნება თუ არა ეს მოდული მონიშნული
          რადგან როდესაც შექმნის დრის ვუთითებთ sales უკვე განსაზღვრულია რომ ამ მომხმარებელს მხოლოდ
          რეალიზაციის გამოუჩნდება. <br /> <br /> ასევე მოდულების გვერდზე გვხვდება „ყველა ფუნქცია“ ამონიშვნის
          შემთხვევაში მომხმარებელს ექნება მოდულზე წვდომა მაგრამ არა სრული უფლებებით, მაგ: თუ
          პროდუქციის მოდული იქნება მონიშნული ხოლო მის გასწვრივ „ყველა ფუნქცია“ ამონიშნული ამ
          შემთხვევაში ასეთ მომხმარებელს ექნება პროდუქციის მოდულზე წვდომა მაგრამ პროდუქციის შექმნისა
          და ჩასწორების უფლება არ ექნება. <br /> <br /> ასევე რეალიზაციის ფანჯარა თუ იქნება მონიშნული ხოლო ყველა
          ფუნქცია ამონიშნული ასეთი იუზერი შეძლებს რეალიზაციებს ნახვას სხვადასხვა კატეგორიებით მაგრამ
          ვერ შეძლებს რეალიზაციის ამოშლას, კოდის გადაკეთებას და თარიღის შეცვლას რეალიზაციაზე.
          ამგვარად შეგვიძლია შევქმნათ მომხმარებლები, მხოლოდ რომელთაც გარკვეულ მოდულებზე ექნებათ
          წვდომა.
          </span>
        </div>
      </div>
    </div>
  );
};

export default Permissions;
