import H2Title from '@/utils/h2title';
import { Image } from 'antd';

const ReportsRemainings = () => {
  return (
    <div>
      <H2Title className="!mb-6 text-xl" title="რეპორტები / ნაშთები" />
      <div>
        <p>
          ნაშთების მოდულში ნაჩვენებია პროდუქციის მოძრაობა მომწოდებლის და დროის მიხედვით. ავირჩიოთ
          მომწოდებელი რომლის ნაშთებიც გვაინტერესებს, მივუთითოთ ნებისმიერი პერიოდი და დავაჭიროთ
          ლუპას.
        </p>
        <Image
          className="!my-4"
          src="https://megaplus.vercel.app/assets/images/docs/reports-balance-table.png"
          preview={false}
        />
        <p>
          გამოტანილი ინფორმაცია არის მომწოდებლის მიხედვით, პროდუქცია რომლის გაყიდვაც მოხდა მინუსში,
          ამ რეპორტში არ იქნება დაანგარიშებული, რადგან პირობითად თუ მომწოდებელმა ზედნადებით
          შემოიტანა 5 ერთეული პროდუქცია, შეცდომით გავყიდეთ 6 ცალი პროდუქცია ან მომწოდებელმა ერთით
          მეტი შემოიტანა ფიზიკურად, ამ შემთხევაში ერთი ცალი პროდუქცია იქნება ზედმეტად გაყიდული, რაც
          არ იქნება დაანგარიშებული მომწოდებლის რეპორტში. აქედან გამომდინარე შესაძლებელია, რომ
          პროდუქციაში არსებული ნაშთი არ ემთხვეოდეს ამ რეპორტის საბოლოო ნაშთს.
        </p>
        <p className='!my-4'>
          ყველა პროდუქციის მოძრაობა არის დაჯამებული და ნაჩვენებია რაოდენობრივად, თვითღირებულება დღგ
          ს ჩათვლით და თვითღირებულების დღგ. თუ არ მივუთითებთ კონკრეტული მომწოდებელს და ისე დავაჭერთ
          ლუპას, ინფორმაცია ნაჩვენები იქნება ყველა პროდუქციაზე. ასევე თუ მოვნიშნავთ მომწოდებლის
          მარცხნივ არსებულ უჯრას, სხვა ინფორმაციასთან ერთად გამოგვიტანს მომწოდებლის ფანჯარას, ანუ
          ვის ეკუთვნის კონკრეტული პროდუქცია.
        </p>
      </div>
    </div>
  );
};

export default ReportsRemainings;
