import H2Title from '@/utils/h2title';
import { Image } from 'antd';
import { paymentTerms } from './data';

const CreateSupplier = () => {
  return (
    <div>
      <H2Title className="!mb-6 text-xl" title="მომწოდებლის შექმნა" />
      <p>
        როგორც აღვნიშნეთ მომწოდებლები რომელთაც ხელშეკრულება აქვთ ფუდმარტთან უკვე რეგისტრირებულები
        არიან პროგრამაში და მათი დამატება არ გვჭირდება. მომწოდებლის შექმნა გვჭირდება იმ შემთხვევაში
        თუ მომწოდებელი არ არის ფუდმარტის ბაზაში და პირველად შემოაქვს პროდუქცია. მომწოდებლის შექმნის
        დროს უნდა გავითვალისწინოთ, რომ მისი რეგისტრირება ხდება მხოლოდ ლოკალურად რაც ნიშნავს იმას,
        რომ მომწოდებელის არცერთი პროდუქცია არ იქნება ხელშეკრულებაში, შესაბამისად მივიღებთ
        ხელშეკრულების გარეშე და მასზე არ იმოქმედებს ბონუს სისტემები. ასევე თუ ამ მომწოდებლის
        პროდუქციას დავაკავშირებთ რომელიმე ხელშეკრულებაში არსებულ პროდუქციაზე, შესაძლოა ჩვენს მიერ
        დაკავშირებულ პროდუქციაზე გამოცხადდეს აქცია, ეს პროდუქცია გაიყიდება აქციით, ხოლო ზარალი არ
        ანაზღაურდება.
      </p>

      <span className="!mt-3 flex items-center gap-x-3">
        <span>
          მომწოდებლის შესაქმნელად ვიყენებთ სურათში მითითებულ კუნძულს. ჩავწეროთ საიდენტიფიკაციო და
          დავაჭიროთ
        </span>
        <Image src="https://megaplus.vercel.app/assets/images/docs/rs-logo.png" preview={false} />
      </span>

      <p className="!my-3">
        შემდეგ ავტომატურად ჩაიწერება მომწოდებლის დასახელება და დღგ-ს შესახებ ინფორმაცია. უნდა
        მივუთითოთ სტატუსი: სტატუსში გვხვდება კონსიგნაცია, წინასწარი და რეალიზაცია.
      </p>
      <Image
        src="https://megaplus.vercel.app/assets/images/docs/suppliers-add.png"
        preview={false}
      />

      <ul className="!mt-6 list-disc space-y-2 !pl-5 *:!mt-4">
        {paymentTerms.map((item, index) => (
          <li key={index}>
            <strong>{item.title}</strong> - {item.description}
          </li>
        ))}
      </ul>

      <p className='!mt-6'>
        მისამართი, ელ ფოსტა და გაყინული თანხა არ არის აუცილებელი ველები, სურვილისამებრ შეგვიძლია
        დავტოვოთ ცარიელი ან მივუთითოთ შესაბამისი ინფორმაცია. დავაჭიროთ დამატებას და დაემატება
        მომწოდებელი. თუ უკვე არსებულ მომწოდებელზე გვინდა ინფორმაციის ცვლილება, მოვძებნოთ
        მომწოდებელი, ავირჩიოთ , შევცვალოთ სასურველი ინფორმაცია და დავაჭიროთ განახლება -ს.
      </p>
    </div>
  );
};

export default CreateSupplier;
