import H2Title from '@/utils/h2title';
import { Image } from 'antd';

const SalaryMovement = () => {
  return (
    <div>
      <H2Title className="text-xl" title="სალაროს მოძრაობა" />
      <p className="!my-6">
        სალაროს მოძრაობის ფანჯარა გამოიყენება მენეჯერისა და მოლარეს შორის თანხის მოძრაობის
        დასაფიქსირებლად. აქ უნდა დავაფიქსიროთ ის თანხა რასაც მივცემთ ჩვენ მოლარეს, და ის თანხა რასაც
        მოლარე დაგვიბრუნებს. ეს რეპორტი, რომ სწორი იყოს ყოველდღე უნდა დავაფიქსიროთ თანხის მოძრაობა.
        როდესაც მოლარეს მივცემთ თანხას (შესაძლოა ეს იყოს სმენის დაწყების წინ მიცემული თანხა
        ხურდისათვის.) შევიყვანოთ ის თანხა რა თანხასაც გავცემთ მოლარეზე, კომენტარში შეგვიძლია
        დავწეროთ დანიშნულება და დავაჭიროთ „თანხის გაცემა“-ს. სმენის დასრულების დროს რა თანხასაც
        დაგვიბრუნებს მოლარე(ჩვენი მიცემული თანხის ჩათვლით) უნდა ჩავწეროთ თანხის მიბარება-ში და
        დავაჭიროთ „თანხის მიბარება“. დაფიქსირებული მოძრაობის ამოშლა შესაძლებელია, უნდა ავირჩიოთ და
        დავაჭიროთ „DELETE“ღილაკს კლავიატურაზე. წაშლილების გამოჩენა თუ გვინდა მოვნიშნოთ წაშლილები.
      </p>
      <Image
        src="https://megaplus.vercel.app/assets/images/docs/cashier-saved.png"
        preview={false}
      />
    </div>
  );
};

export default SalaryMovement;
