import H2Title from '@/utils/h2title';
import { Image } from 'antd';

const GroupControl = () => {
  return (
    <div>
      <H2Title className="text-xl" title="ჯგუფების კონტროლი" />
      <p className="!mt-6">
        პროგრამაში, პროდუქციის ფანჯარაში შეგვიძლია შევქმნათ ჯგუფები, გავაწევრიანოთ პროდუქციები
        შესაბამის ჯგუფებში რაც დაგვეხმარება პროდუქციის ფილტრაციაში და გაგვიმარტივებს ჯგუფების
        მიხედვით აღწერის პროცესს. თავდაპირველად პროგრამაში არ არის შექმნილი ჯგუფები, ჩვენ შეგვიძლია
        ჯგუფების შექმნა ჩვენი სურვილიდან გამომდინარე. ჯგუფის შექმნის დროს აუცილებელია ვიდგეთ იმ
        ჯგუფზე ან ობიექტზე სადაც გვინდა ჯგუფის ან ქვეჯგუფის შექმნა.
      </p>
      <div className="!mt-3">
        თავდაპირველად, როდესაც პირველ ჯგუფს ვქმნით უნდა დავდგეთ ობიექტის სახელზე,
      </div>
      <div className="!mt-2">დავაჭიროთ მწვანე ისარს</div>
      <div className="!mt-3">
        <Image
          preview={false}
          src="https://megaplus.vercel.app/assets/images/docs/groupControl-img.png"
        />
      </div>
      <p className="!py-3">
        რის შემდეგაც გამოვა დამატებითი ფანჯარა სადაც უნდა შევიყვანოთ ჯგუფის ინფორმაცია.
      </p>
      <div>
        <Image
          preview={false}
          src="https://megaplus.vercel.app/assets/images/docs/groupCode-img.png"
        />
        <p className="!py-3">
          კოდში შეგვიძლია მივანიჭოთ ჯგუფს კოდი და შემდგომში ჯგუფი მოვძებნოთ კოდის მიხედვით, ასევე
          შეგვიძლია ეს ფანჯარა დავტოვოთ ცარიელი და უკოდოთ შევქმნათ ჯგუფი. ჯგუფი- უნდა შევიყვანოთ
          ჯგუფის დასახელება. დავაჭიროთ შექმნას და შეიქმნება ახალი ჯგუფი. აუცილებელია რომ თუ ჯგუფს
          ვქმნით ვიდგეთ ჩვენი ობიექტის დასახელებაზე და არა სამ ტირეზე წინააღმდეგ შემთხვევაში
          შეიქმნება ობიექტი და არა ჯგუფი. ქვეჯგუფიც იქმნება ანალოგიურად, უბრალოდ, უნდა ვიდგეთ იმ
          ჯგუფზე რომელშიც გვინდა რომ შეიქმნას ქვეჯგუფი.
        </p>
      </div>

      <div className="!mt-4 grid grid-cols-4 gap-x-6">
        <div className="">
          <Image src="https://megaplus.vercel.app/assets/images/docs/underGoup-img.png" />
        </div>
        <div className="col-span-3">
          <span>
            კონკრეტულად ასეთი სისტემის შექმნის დროს უნდა დავდგეთ ჩვენს ობიექტზე, დავაჭიროთ მწვანე
            ისარს ჩავწეროთ ჯგუფის დასახელება “სასმელები“(სურვილის შემთხვევაში კოდიც) და დავაჭიროთ
            „შექმნა“-ს. შემდეგ დავდგეთ სასმელებზე და შევქმნათ ქვეჯგუფები „ალკოჰოლური“ და „არა
            ალკოჰოლური“ ამის შემდეგ დავდგეთ „ალკოჰოლური“-ზე და შევქმნათ ქვეჯგუფი არაყი. დავდგეთ „არა
            ალკოჰოლურზე“ და შევქმნათ ქვეჯგუფი „გაზიანი სასმელები“. დავდგეთ „არა ალკოჰოლური“-ზე და
            შევქმნათ ქვეჯგუფი წვენი. ლიმონათის შესაქმნელად უკვე უნდა დავდგეთ გაზიანი სასმელების
            ქვეჯგუფზე და შევქმნათ ლიმონათი. ამის მსგავსად შეგვიძლია შევქმნათ ჯგუფები და ქვეჯგუფები.
            აუცილებელია დავდგეთ იმ ჯგუფზე რომელში გვინდა რომ შევქმნათ ქვეჯგუფი ან ვაქციოთ ჯგუფად.
          </span>
        </div>
      </div>

      <div>
        <H2Title className="text-xl !mb-4" title="ჯგუფის სახელის შეცვლა" />
        <p>
          ჯგუფის სახელის შესაცვლელად უნდა დავდგეთ ჯგუფზე, რომლის სახელის შეცვლაც გვინდა, დავაჭიროთ
          მწვანე ისარს საიდანაც ვქმნით ჯგუფს, ჩავწეროთ ახალი სახელი და დავაჭიროთ „შეცვლა“-ს.
        </p>
      </div>

      <div>
        <H2Title className="text-xl !mb-4" title="პროდუქციის ჯგუფში გაწევრიანება" />
        <p>
          პროდუქციის ჯგუფში გაწევრიანებისთვის დავდგეთ პროდუქციაზე (უნდა გახდეს ლურჯი), ავირჩიოთ ჯგუფი
          რომელშიც უნდა გავაწევრიანოთ პროდუქცია და დავაჭიროთ ჩასწორებას. თუ გვინდა, რომ რამდენიმე
          პროდუქცია ერთად გავაწევრიანოთ ერთ ჯგუფში, ამისთვის სასურველი პროდუქციები უნდა მოვნიშნოთ
          ჯგუფის სვეტში (ჯგუფის სვეტი უნდა მოვნიშნოთ მხოლოდ) ავირჩიოთ სასურველი ჯგუფი და დავაჭიროთ
          ჩასწორებას. ჯგუფის კონტროლი შესაძლებელია მხოლოდ არა ფრენჩაიზებში, და არ არის შესაძლებელი
          პროგრამის MINI ვერსიაში.
        </p>
      </div>
    </div>
  );
};

export default GroupControl;
