export const reportSuppliersOperationFields = [
  {
    title: 'დრო',
    description: 'როდის მოხდა ოპერაცია.',
  },
  {
    title: 'საიდენტიფიკაციო',
    description: 'მომწოდებლის საიდენტიფიკაციო.',
  },
  {
    title: 'ხელშეკრულება',
    description: 'რომელი ხელშეკრულებით მოხდა მიღება, დაბრუნება და გადახდა.',
  },
  {
    title: 'ოპერაცია',
    description:
      'რომელი ოპერაცია შესრულდა (მიღების ან დაბრუნების შემთხვევაში დოკუმენტის, ხოლო გადახდის შემთხვევაში ხელშეკრულების ნომერია მითითებული).',
  },
  {
    title: 'დავალიანება საწყისი',
    description: 'ოპერაციამდე რამდენი გვქონდა დავალიანება (ნაჩვენებია ბუღალტრული ვალი).',
  },
  {
    title: 'გაზრდა (დავალიანება)',
    description: 'რა თანხის დოკუმენტის მიღება მოხდა.',
  },
  {
    title: 'შემცირება (დავალიანება)',
    description: 'რა თანხის დაბრუნება ან გადახდა შესრულდა მომწოდებელთან.',
  },
  {
    title: 'დავალიანება (საბოლოო)',
    description: 'კონკრეტული ოპერაციის შემდეგ რამდენი დაგვრჩა ბუღალტრული დავალიანება.',
  },
  {
    title: 'SUM',
    description: 'აჯამებს ყველა ველის თანხას.',
  },
];
