import H2Title from '@/utils/h2title';
import { Image } from 'antd';

const Calculation = () => {
  return (
    <div>
      <div>
        <H2Title className="text-xl" title="კალკულაცია" />
        <p className="!py-4">
          კალკულაცია საშუალებას გვაძლევს რამდენიმე პროდუქტი გავყიდოთ ერთ კოდზე. უფრო გასაგები რომ
          იყოს ავიღოთ შემდეგი მაგალითი: დავუშვათ რომ გვინდა გავაკეთოთ სასაჩუქრე კალათა, კალათში უნდა
          იყოს შამპანური, სნიკერსი , შოკოლადის ფილა და კალათა. სასაჩუქრე კალათის გასაყიდად
          კალკულაციის გარეშე მოგვიწევდა რომ ყველა კალათაში არსებული პროდუქცია ცალ-ცალკე
          გაგვეტარებინა , მაგრამ კალკულაციის საშუალებით შეგვიძლია შევქმნათ ერთი პროდუქცია „სასაჩუქრე
          კალათა“ სადაც დავამატებთ ყველა იმ პროდუქციას რაც ამ კალათაში უნდა იყოს. ვნახოთ ეს
          ყველაფერი პრაქტიკაში : პირველ რიგში შევქმნათ პროდუქცია რაზეც შემდგომში გავაკეთებთ
          კალკულაციას.
        </p>
        <Image
          preview={false}
          src="https://megaplus.vercel.app/assets/images/docs/calculation-creation.png"
        />
        <p className="!mt-1">
          დავაჭიროთ შექმნას და ავირჩიოთ ჩვენს მიერ შექმნილი პროდუქცია. (რომ ავირჩევთ გალურჯდება)
        </p>
      </div>

      <div className="!mt-3">
        <p>ახლა დავაჭიროთ მწვანე ისარს სურათში მითითებულ ადგილას:</p>
        <Image
          className="!mt-2"
          preview={false}
          src="https://megaplus.vercel.app/assets/images/docs/calculation-selfPrice.png"
        />
      </div>

      <div className="!mt-12 grid grid-cols-4 gap-x-6">
        <div className="">
          <Image src="https://megaplus.vercel.app/assets/images/docs/calculation-window.png" />
        </div>
        <div className="col-span-3">
          <p>
            გამოგვიტანს ფანჯარას , გადავიდეთ კალკულაციის მოდულში. (კალკულაციის დაწყებამდე
            დავრწმუნდეთ რომ ვდგავართ სწორ პროდუქციაზე) ჩვენს შემთხვევაში ვამატებთ შემდეგ
            პროდუქციებს:
          </p>

          <Image
            className="!py-6"
            preview={false}
            src="https://megaplus.vercel.app/assets/images/docs/calculation-table.png"
          />

          <p>
            დავაჭიროთ მწვანე პლიუსს და გამოტანილ ფანჯარაში მოვძებნოთ პროდუქცია , ავირჩიოთ, მივუთითოთ
            რაოდენობა და დავაჭიროთ მწვანე მონიშვნას.
          </p>

          <Image
            className="!py-6"
            preview={false}
            src="https://megaplus.vercel.app/assets/images/docs/calculation-basket.png"
          />
        </div>
      </div>

      <div className="!mt-12 grid grid-cols-5 gap-x-6">
        <div className="col-span-2">
          <Image src="https://megaplus.vercel.app/assets/images/docs/calculation-table-filled.png" />
        </div>
        <div className="col-span-3">
          <span>
            <p>
              {' '}
              ყველა პროდუქციის ჩამატების შემდეგ შეგვიძლია დავიწყოთ პროდუქციის გაყიდვა. პროდუქციას თუ
              არასწორად ჩავამატებთ შეგვიძლია მოვნიშნოთ წაშლის დადასტურება და დავაჭიროთ
            </p>
            <Image
              className="!py-3"
              preview={false}
              src="https://megaplus.vercel.app/assets/images/docs/calculation-delete.png"
            />
            <p>
              იმ შემთხვევაში, თუ არასწორად ჩამატებული პროდუქცია აღმოვაჩინეთ იმის შემდეგ რაც
              კალკულაციის პროდუქციის გაყიდვა დაწყებული, პირდაპირ ამოშლა არ შეიძლება, რადგან
              გაყიდვებიც ამოიშლება. ასეთ შემთხევაში, უნდა გამოვრთოთ, ამოვნიშნოთ, სიმულაცია, წავშალოთ
              პროდუქცია და შემდეგ დავამატოთ სწორი პროდუქცია იმ თარიღით როდესაც გავაკეთეთ კალკულაცია,
              რადგან გაყიდვები გამოაკლდეს პროდუქციას იმ თარიღიდან, როდესაც დაიწყო კალკულაციის
              პროდუქციის გაყიდვა. ვუშვათ, რომ სასაჩუქრე კალათიდან გვინდა ამოვიღოთ სნიკერსი და გვინდა
              ჩავამატოთ ბაუნტი. პროგრამულად უნდა გავაკეთოთ შემდეგი ოპერაცია: დავდგეთ პროდუქციაზე
              რომელიც გვინდა რომ ავიღოთ, მოვნიშნოთ თარიღი რა დროიდანაც გვინდა ამოღება(თარიღის
              მონიშვნა გვჭირდება იმ შემთხვევაში თუ წინა პერიოდით გვინდა ამ ოპერაციის შესრულება) და
              დავაჭიროთ ამოღებას
            </p>
            <Image
              className="!py-3"
              preview={false}
              src="https://megaplus.vercel.app/assets/images/docs/calculation-date.png"
            />
            <p>
              ახლა ჩავამატოთ ბაუნტი ჩვენს კალკულაციაში. საბოლოოდ პროგრამა სასაჩუქრე კალათის გაყიდვის
              დროს ნაშთიდა დაიწყებს სნიკერსის მაგივრად ბაუნტის გამოკლებას. რეცეპტი - გამოიყენება
              ინგრედიენტების ჩასაწერად , ან შეგვიძლია გამოვიყენოთ კალკულაციის ისტორიის კომენტარის
              სახით ჩასაწერად. ანალოგიურად გამოიყენება აპარატის ყავის პროგრამულად გასაყიდად.
            </p>
          </span>
        </div>
      </div>

      <div className="">
        <H2Title className="!mb-4 text-xl" title="წარმოება" />
        <p>
          კალკულაციის გაკეთების შემდეგ, როდესაც კალკულაციის პროდუქცია გაიყიდება, ვიცით, რომ
          კალკულაციის პროდუქციას ნაშთი არ გამოაკლდება, ვინაიდან კალკულაციაში შეყვანილ პროდუქციებს
          აკლდება ნაშთზე ის რაოდენობა რაც კალკულაციაში გვექნება მითითებული. წარმოებით შეგვიძლია
          წინასწარ ვაწარმოოთ პროდუქცია, ანუ წინასწარ გამოაკლოს კალკულაციაში შეყვანილი პროდუქციები
          ნაშთიდან და თვითონ კალკულაციის პროდუქციაზე დაემატოს ნაშთი. უფრო ადვილად რომ გავიგოთ ავიღოთ
          ესეთი მაგალითი: დავუშვათ ვაწარმოებთ ლობიანს, კალკულაციაში შევიყვანდით 1 ლობიანს რა
          ინგრედიენტებიც სჭირდება, როდესაც ლობიანი გაიყიდებოდა, პროგრამა ავტომატურად გამოაკლებდა
          კალკულაციაში შეყვანილ რაოდენობებს კალკულაციაში შეყვანილ პროდუქციებს. თვითონ კალკულაციის
          პროდუქცია ნაშთზე იქნებოდა ყოველთვის ნული და ვერ გავიგებდით რამდენი ლობიანი გვაქვს ახლა
          მაღაზიაში, წარმოების შემთხვევაში , თუ გამოვაცხობთ პირობითად 10 ლობიანს , გავაკეთებთ ამის
          წარმოებას და 10 ცალი ლობიანი აგვესახება პროდუქცია „ლობიანი“-ს ნაშთზე, ხოლო კალკულაციაში
          შეყვანილ პროდუქციებს წინასწარ გამოაკლდება 10 ცალი ლობიანისთვის საჭირო რაოდენობა. ლობიანის
          გაყიდვის შემთხვევაში პირდაპირ ლობიანის ნაშთს გამოაკლდება 1 ერთეული და დარჩება ნაშთზე 9
          ცალი. წარმოებისათვის უნდა გადავიდეთ წარმოებაში ჩავწეროთ რაოდენობა რამდენი ერთეულის
          წარმოებაც გვინდა და დავაჭიროთ წარმოებას.
        </p>
      </div>
    </div>
  );
};

export default Calculation;
