export const financialStatus = [
  {
    title: 'მიღება',
    description: 'რა თანხის პროდუქცია მივიღეთ.',
  },
  {
    title: 'გადახდა',
    description: 'რა თანხა გადავიხადეთ.',
  },
  {
    title: 'ბალანსი',
    description: 'საბოლოო დავალიანება.',
  },
];

export const contractInfo = [
  {
    label: 'საიდენტ.',
    description: 'მომწოდებლის საიდენტიფიკაციო კოდი',
  },
  {
    label: 'მომწ.დასახ.',
    description: 'მომწოდებლის დასახელება',
  },
  {
    label: 'კოდი',
    description: 'ხელშეკრულების ნომერი',
  },
  {
    label: 'დასახელება',
    description: 'ხელშეკრულების სახელი',
  },
  {
    label: 'პირობა',
    description: 'ხელშეკრულების პირობა არის შესყიდვებით თუ გაყიდვებით',
  },
  {
    label: 'ანგ.სწორ.დრო',
    description: 'რა თარიღში გვიწევს ამ მომწოდებელთან ანგარიშსწორება (უახლოესი დრო)',
  },
  {
    label: 'პერ.დასაწყისი / პერ.ბოლო',
    description:
      'ანგარიშსწორების დროს რა პერიოდიდან რა პერიოდამდე გაყიდული ან მიღებული პროდუქციის თანხას ვუხდით მომწოდებელს',
  },
  {
    label: 'გადასახდელი / გადახდა სულ',
    description: 'რა თანხა გვქონდა სულ გადასახდელი / რა თანხა გადავუხადეთ',
  },
];

export const paymentInfo = [
  {
    label: 'გადახდის ტიპი',
    description:
      'შევიყვანოთ როგორ მოხდა ანგარიშსწორება, ქეშად თუ ბარათით (შეგვიძლია მივაბათ ანგარიშის ნომრებიც და დავაფიქსიროთ რომელი ანგარიშიდან მოხდა გადარიცხვა).',
  },
  {
    label: 'თანხა',
    description: 'გადარიცხული თანხის რაოდენობა. ათწილადის გამოსაყოფად უნდა გამოვიყენოთ წერტილი.',
  },
  {
    label: 'კომენტარი (ხელშეკრულების N)',
    description:
      'კოდზე დაკლიკების დროს ავტომატურად დაკოპირდა ხელშეკრულების ნომერი ჩავაკოპიროთ ამ ველში.',
  },
];
