export const filters = [
  {
    title: 'დროის ფილტრაცია',
    description: 'შეგვიძლია ავირჩიოთ და ვნახოთ მიღებები ნებისმიერი პერიოდით.',
  },
  {
    title: 'პროდუქციის დასახელება',
    description: 'შეგვიძლია მიღებები მოვძებნოთ პროდუქციის დასახლების მიხედვით.',
  },
  {
    title: 'კოდი',
    description: 'მოვძებნოთ მიღებები შტრიხკოდის მოყურებით.',
  },
  {
    title: 'მომწოდებელი',
    description: 'გავფილტროთ მხოლოდ სასურველი მომწოდებლის შემოტანილი პროდუქციის მიღებები.',
  },
  {
    title: 'დოკ N',
    description:
      'ზედნადების ან ნებისმიერი დოკუმენტის ნომერის ჩაწერისას გვაჩვენებს ამ კონკრეტულ ზედნადებში რა პროდუქციების მიღება მოხდა.',
  },
];
