export const salesInfo = [
  {
    key: 'cashier',
    label: 'მოლარე',
    description:
      'მომხმარებლის სახელები, ვისაც არჩევის შემდეგ გვაჩვენებს რა ჩეკები აქვს გატარებული კონკრეტულ მოლარეს.',
  },
  {
    key: 'cash',
    label: 'ნაღდი',
    description: 'კონკრეტულ იუზერს (მითითებულ დროის პერიოდში) რამდენი აქვს ნაღდზე გაყიდული.',
  },
  {
    key: 'nonCash',
    label: 'უნაღდო',
    description: 'კონკრეტულ იუზერს (მითითებულ დროის პერიოდში) რამდენი აქვს გაყიდული ბარათით.',
  },
  {
    key: 'pending',
    label: 'მიმდინარე',
    description:
      'რეალიზაციის მოდულში არის გატარებული პროდუქცია და არ არის გადაშვებული რეალიზაციაში.',
  },
  { key: 'total', label: 'ჯამი', description: 'ნაღდის და უნაღდოს ჯამი.' },
  { key: 'quantity', label: 'რაოდენობა', description: 'მომხმარებლების, ჩეკების ჯამური რაოდენობა.' },
  { key: 'startDate', label: 'საწყისი', description: 'ცვლის გახსნის თარიღი.' },
  { key: 'endDate', label: 'დასასრული', description: 'დასასრული.' },
];
