import H2Title from '@/utils/h2title';
import { Image } from 'antd';
import { salesInfo } from './data';

const Purchased = () => {
  return (
    <div>
      <H2Title className="text-xl" title="სალაროს მოდულები" />
      <div>
        <p className="!my-6">
          სალაროს ფანჯრიდან შეგვიძლია ვნახოთ: რეალიზაციები მოლარეების მიხედვით , ვაკონტროლოთ სალარო
          და ატვირთოთ ზედნადებები. რეალიზაციის ფანჯარაში გატარებული ყველა პროდუქცია გამოგვიჩნდება
          სალაროს მოდულში იმის მიხედვით თუ რომელი მომხმარებლიდან მოხდა რეალიზაცია.
        </p>
        <p className="!mb-3">
          დროის ფილტრაციით შეგვიძლია ვნახოთ მოლარის რეალიზაციები(ჩეკები). შეგვიძლია ავირჩიოთ ან
          ხელით ჩავწეროთ სასურველი თარიღი ან დრო.
        </p>
        <Image
          src="https://megaplus.vercel.app/assets/images/docs/cashier-calendar.png"
          preview={false}
        />
      </div>

      <div className="!mt-6">
        <p className="!mb-3">
          დროის არჩევის შემდეგ გამოჩნდება არჩეულ პერიოდში რომელი მოლარეები მუშაობდნენ და ოდენობის
          თანხა ქონდათ რეალიზებული.
        </p>

        <Image
          src="https://megaplus.vercel.app/assets/images/docs/cashier-table.png"
          preview={false}
        />

        <ul className="!my-3 list-disc !space-y-3 !pl-5 text-sm leading-relaxed">
          {salesInfo.map((item) => (
            <li key={item.key}>
              <strong>{item.label}</strong> - {item.description}
            </li>
          ))}
        </ul>
        <p className="!mt-8 !mb-3">
          ამ ფანჯარაში დაჯამებულია ყველა გამოტანილი იუზერის მიერ ნავაჭრი ნაღდი, უნაღდო, მიმდინარე,
          ნაღდის და უნაღდოს ჯამი, მომხმარებლების რაოდენობა და საშუალო დანახარჯი ერთი
          მომხმარებლისგან:
        </p>
        <Image
          src="https://megaplus.vercel.app/assets/images/docs/cashier-money-table.png"
          preview={false}
        />
      </div>

      <div>
        <p className="!mt-8">
          როგორც ვახსენეთ იუზერის არჩევის შემდეგ გამოგვიტანს ამ იუზერის მიერ გაყიდულ ჩეკებს. <br />{' '}
          ავირჩიოთ მოლარე :
        </p>
        <Image
          className="!my-3"
          src="https://megaplus.vercel.app/assets/images/docs/cashier-table2.png"
          preview={false}
        />
        <p>
          N არის ჩეკის ნომერი რომელიც ასევე დატანილია სალარო აპარატიდან ამოსულ ჩეკზე(აუცილებელია,
          რომ გადაშვებული იყოს პროგრამიდან, სხვა შემთხვევაში არ დაემთხვევა ერთმანეთს.) თუ თანხა
          წერია ნაღდში ეს იმას ნიშნავს, რომ რეალიზაცია მოხდა ნაღდი ანგარიშსწორებით, თუ თანხა წერია
          უნაღდოში ნიშნავს იმას რომ რეალიზაცია მოხდა უნაღდო ანგარიშსწორებით(ბარათით გადაიხადა) ხოლო
          იმ შემთხვევაში თუ თანხა წერია მიმდინარეში ნიშნავს, რომ ამ კონკრეტულ ჩეკში გატარებული
          პროდუქცია გატარებული არის რეალიზაციის ფანჯარაში, მაგრამ არ არის გაყიდული ანუ არ არის
          გადაშვებული არც ნაღდზე და არც უნაღდოზე, შესაბამისად ეს გატარება ისევ რეალიზაციის ფანჯარაში
          იქნება. ასევე გამოტანილია დრო, რა თარიღსა და დროს მოხდა კონკრეტული ჩეკის გატარება-გაყიდვა.
        </p>
      </div>

      <div className="!mt-8">
        <p>
          ჩეკის არჩევის შემთხვევაში გვაჩვენებს რა პროდუქციები არის ამ კონკრეტული ჩეკით გაყიდული:{' '}
          <br /> <br />
          ნაჩვენებია პროდუქციის ინფორმაცია როგორიცაა : <br /> კოდი , შტრიხკოდი, დასახელება, ასევე
          ნაჩვენებია რაოდენობა თუ რამდენი გაიყიდა , ფასი - რა ფასში მოხდა რეალიზაცია, ჯამი და დრო.
        </p>
        <Image
          className="!my-4"
          src="https://megaplus-images.vercel.app/assets/11-CEo35zOM.png"
          preview={false}
        />
        <p>
          არის შემთხვევები როდესაც რაოდენობაში წერია 0. ეს ის შემთხვევაა როდესაც მოლარემ რეალიზაციის
          ფანჯარაში გაატარა პროდუქცია და შემდეგ ამოშალა. <br /> ამ პროდუქციის რეალიზაცია არ
          მომხდარა, მაგრამ პროგრამა ასეთ გატარებებს ინახავს და გვაჩვენებს იმ ჩეკში სადაც ამოიშალა ეს
          პროდუქცია.
        </p>
      </div>

      <div className="!mt-8">
        <p>
          სალაროს ფანჯარაში ასევე გვაქვს დამატებითი ძებნის ფუნქციები რომელიც გამოჩნდება მწვანე
          ისარზე დაჭერის შემდეგ.
        </p>
        <Image
          className="!my-4"
          src="https://megaplus.vercel.app/assets/images/docs/cashier-search.png"
          preview={false}
        />
        <p>
          შეგვიძლია მოვძებნოთ ჩეკი კლიენტის ნომრით. ჩავწეროთ ჩეკის ნომერი ავირჩიოთ შესაბამისი თარიღი
          და დავაჭიროთ ენთერ ღილაკს კლავიატურაზე, რის შემდეგაც მოგვიძებნის ამ კონკრეტულ ჩეკს.
          როდესაც შევდივართ სალაროს ფანჯარაში ავტომატურად გვიფილტრავს მიმდინარე თარიღს და ნაჩვენებია
          მხოლოდ მოლარეების მომხმარებლების გაყიდვა. თუ გვინდა გამოგვიჩნდეს სხვა დონის მქონე იუზერის
          გაყიდვები უნდა მოვხსნათ მონიშვნა „მხოლოდ მოლარეები“. ხოლო თუ გვინდა მხოლოდ ისეთი ჩეკების
          ნახვა რომლებშიც მოხდა ჩასწორება(პროდუქციის ამოშლა ან რაოდენობის მომატება-დაკლება) უნდა
          მოვნიშნოთ „ჩასწორებულები“. ასევე შეგვიძლია ვნახოთ კონკრეტული მოლარის გაყიდვები, ჩამოვშალოთ
          „მოლარე“ ავირჩიოთ სასურველი მომხმარებელი. ობიექტის ფილტრაცია გვჭირდება იმ შემთხვევაში თუ
          ერთ პროგრამაში ჩამატებული გვაქვს ერთი შპს-ს სხვადასხვა ფილიალები და ამ პროგრამიდან
          კონკრეტული ობიექტის რეალიზაციების ნახვა გვსურს. როგორც ვხედავთ ამ ფანჯარაში გვხვდება მეორე
          მწვანე ისარიც რომლის დაჭერის შემდეგაც ფანჯრის ქვედა ნაწილში გამოჩნდება დამატებითი ფანჯარა.
          ამ ფანჯრიდან შეგვიძლია ჩავასწოროთ ნაღდი და უნაღდო გაყიდვები. მაგ: თუ მოლარეს შეეშალა
          გაყიდვა და უნაღდოს მაგივრად გაყიდვა გადაიტანა ნაღდზე შეგვიძლია შევცვალოთ პროგრამულად, უნდა
          ვიცოდეთ, რომ ეს ცვლილება მხოლოდ პროგრამულად განხორციელდება და სალარო აპარატზე ისევ
          უნაღდო-ზე იქნება დაფიქსირებული. <br /> <br />
          <Image
            src="https://megaplus.vercel.app/assets/images/docs/cashier-book.png"
            preview={false}
            alt="refresh"
            width={34}
            height={34}
            className="inline-block align-middle"
          />
          დეტალური რეპორტი მოლარეების მიხედვით.
        </p>
      </div>
    </div>
  );
};

export default Purchased;
