import H2Title from '@/utils/h2title';

const Purchased = () => {
  return (
    <div>
      <H2Title className="! text-xl" title="სალაროს მოდულები" />
      <p className='!my-6'>
        სალაროს ფანჯრიდან შეგვიძლია ვნახოთ: რეალიზაციები მოლარეების მიხედვით , ვაკონტროლოთ სალარო და
        ატვირთოთ ზედნადებები. რეალიზაციის ფანჯარაში გატარებული ყველა პროდუქცია გამოგვიჩნდება სალაროს
        მოდულში იმის მიხედვით თუ რომელი მომხმარებლიდან მოხდა რეალიზაცია.
      </p>
      <p>
        დროის ფილტრაციით შეგვიძლია ვნახოთ მოლარის რეალიზაციები(ჩეკები). შეგვიძლია ავირჩიოთ ან ხელით ჩავწეროთ სასურველი თარიღი ან დრო.
      </p>
    </div>
  );
};

export default Purchased;
