export const userFields = [
  {
    title: "დასახელება",
    description:
      "შევიყვანოთ მომხმარებელს რასაც ვარქმევთ, შეიძლება იყოს პოზიცია (ადმინისტრატორი, მენეჯერი) ან უბრალოდ სახელი.",
  },
  {
    title: "ბარათის ნომერი",
    description:
      "შევიყვანოთ ბარათის ნომერი. არქონის შემთხვევაში შევიყვანოთ სასურველი ციფრები, არ უნდა ემთხვეოდეს პაროლს.",
  },
  {
    title: "პაროლი",
    description:
      "შევიყვანოთ პაროლით საკონტაქტო ინფორმაცია, მისამართი ან სხვა დამატებითი ინფორმაცია.",
  },
];

export const userRoles = [
  {
    title: "ADMIN",
    description: "მომხმარებელი, რომელსაც პროგრამის ყველა მოდულზე უნდა ქონდეს წვდომა.",
  },
  {
    title: "SALES",
    description: "მივუთითოთ მოლარის მომხმარებლის შექმნისას. ექნება მხოლოდ რეალიზაციის მოდული.",
  },
  {
    title: "SALES2",
    description: "მოლარე, გამოიყენება კვების ობიექტებისთვის.",
  },
  {
    title: "ადმინი",
    description: "ამ უფლებას არ ვუთითებთ, მხოლოდ აქვს მენეჯერის იუზერს, რომელიც პროგრამის ჩაწერისას იქმნება.",
  },
];
