import H2Title from '@/utils/h2title';
import { Image } from 'antd';

const Discounts = () => {
  return (
    <div>
      <H2Title className="text-xl" title="ფასდაკლებები" />
      <p className="!py-4">
        პროგრამის საშუალებით შეგვიძლია გავაკეთოთ ფასდაკლებები დღის მონაკვეთებში , მაგალითად
        პროდუქცია , რომლის გასაყიდი ფასიც არის 10 ლარი , შეგვიძლია 15:00 საათზე ფასი გავხადოთ 5 ლარი
        და შემდეგ 18:00 ზე გახდეს ისევ 10 ლარი. დავაჭიროთ პროდუქციის სრული თვით ღირებულებისგან
        მარჯვნივ არსებულ მწვანე ისარს.
      </p>
      <Image
        preview={false}
        src="https://megaplus.vercel.app/assets/images/docs/calculation-selfPrice.png"
      />
      <div className="!my-4">მწვანე ისარზე დაჭერის შემდეგ გამოგვიტანს შემდეგ ფანჯარას:</div>

      <div className="grid grid-cols-5 gap-x-6">
        <div className="">
          <Image src="https://megaplus.vercel.app/assets/images/docs/priceCalculation-img.png" />
        </div>
        <div className="col-span-4">
          <span>
            როგორც ვხედავთ ჯგუფის გრაფაში წერია დრო. ფასდაკლების გასაკეთებლად, დროის გასწვრივ,
            ფასში, უნდა ჩავწეროთ რა ფასში გვინდა გაიყიდოს პროდუქცია მითითებულ დროს , ხოლო მეორე
            ველში უნდა ჩავწეროთ პროდუქციის პირვანდელი ფასი , რადგან მითითებულ დროს, ისევ პირვანდელ
            ფასს დაუბრუნდეს პროდუქცია. დროის მითითება ხდება SQL პროგრამიდან , სჭირდება გარკვეული
            ცოდნა და უმჯობესია, დროის მისათითებლად, დაუკავშირდეთ მეგა პლუსს 032 2 500 601 - ზე.
            სასურველი დროისა და ფასების მითითების შემდეგ უნდა დავაჭიროთ მარჯვენა ქვედა კუთხეში ,
            სურათზე წითლად მონიშნულ ხატულას. დროის და ფასების დამახსოვრების შემდეგ, პროგრამა
            ავტომატურად შეცვლის ფასებს დროის მიხედვით. შესაბამისად მხოლოდ სასურველ პროდუქციებზე
            ერთხელ უნდა გავიმეოროთ ეს ოპერაცია. იმ შემთხვევაში თუ აქციის გაუქმება გვინდა ფასში(ორივე
            ზოლში) უნდა ჩავწეროთ: 0.00(წერტილი) და დავამახსოვროთ ინფორმაცია.
          </span>
        </div>
      </div>

      <div>
        <H2Title className="text-xl" title="აქციის შექმნა" />
        <p className="!py-6">
          აქცია იქმნება პროდუქციის ფანჯრიდან , მოვიძიოთ პროდუქცია , რომელზეც აქცია გვინდა რომ
          გავაკეთოთ, მოვნიშნავთ (გავალურჯებთ) და დავაჭიროთ ქვედა მარჯვენა კუთხეში არსებულ მწვანე
          ისარს.
        </p>
        <Image
          preview={false}
          src="https://megaplus.vercel.app/assets/images/docs/create-price-img.png"
        />
        <p className="!py-6">
          ამოტანილ ფანჯარაში მოვძებნოთ „ფასდაკლებამდე“ - ველი. „ფასდაკლებამდე“- ჩავწეროთ პროდუქციის
          ამჟამინდელი ფასი, ხოლო „ფასი“ - ში ჩავწეროთ სააქციო ფასი. აქციის გაკეთების დროს
          რეკომენდირებულია კომენტარში მიუთითოთ, რომ ეს არის ჩვენი აქცია. საბოლოო შედეგი გამოიყურება
          ასე:
        </p>
        <Image src="https://megaplus.vercel.app/assets/images/docs/priceChange-field-img.png" />
        <div className="!py-4">დავაჭიროთ „ჩასწორება“-ს.</div>
        <span>
          ხელით შექმნილი აქცია ავტომატურად აქ უქმდება, ამიტომ, ხელითვე უნდა გავაუქმოთ. გასაუქმებლად
          ფასდაკლებამდე ფასში ვწერთ 0 -ს , ხოლო ფასში სარეალიზაციო ფასს, ვაჭერთ ჩასწორებას.
          <div className="flex items-center gap-x-4">
            <span> პროდუქციას სტატუსის ზოლში ჩაუჯდება აქციის მაჩვენებელი ნიშანი :</span>
            <span>
              <Image
                width={80}
                height={35}
                preview={false}
                src="https://megaplus.vercel.app/assets/images/docs/action-img.png"
              />
            </span>
          </div>
          <div className="!mt-14">
            <div>სააქციო ფასის ამობეჭდვის დროს ფას მაჩვენებელი ამოვა შემდეგი ფორმატით :</div>
            <Image
              className="!mt-14"
              preview={false}
              src="https://megaplus.vercel.app/assets/images/docs/priceControl-result.png"
            />
          </div>
        </span>
      </div>
    </div>
  );
};

export default Discounts;
